Autodesk.Revit.DB.ViewScheduleExportOptions.IsValidObject
Specifies whether the .NET object represents a valid Revit entity.
Remarks:
If the corresponding Revit native object is destroyed, or creation of the corresponding object is undone,
a managed API object containing it is no longer valid. API methods cannot be called on invalidated wrapper objects.
Returns:
True if the API object holds a valid Revit native object, false otherwise.
Since:
2014

Autodesk.Revit.DB.ViewScheduleExportOptions.Title
Whether or not to export the schedule title. Default is true.
Since:
2014

Autodesk.Revit.DB.ViewScheduleExportOptions.HeadersFootersBlanks
Whether to export group headers, footers, and blank lines. Default is true.
Since:
2013

Autodesk.Revit.DB.ViewScheduleExportOptions.FieldDelimiter
How to delimit fields. Default is Tab.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
When setting this property: A non-optional argument was NULL
Since:
2013

Autodesk.Revit.DB.ViewScheduleExportOptions.ColumnHeaders
How to export column headers. Default is MultipleRows.
Throws Autodesk.Revit.Exceptions.ArgumentOutOfRangeException:
When setting this property: A value passed for an enumeration argument is not a member of that enumeration
Since:
2013

Autodesk.Revit.DB.ViewScheduleExportOptions.TextQualifier
How to qualify text fields. Default is DoubleQuote.
Throws Autodesk.Revit.Exceptions.ArgumentOutOfRangeException:
When setting this property: A value passed for an enumeration argument is not a member of that enumeration
Since:
2013

Autodesk.Revit.DB.ViewScheduleExportOptions.#ctor
Constructs a new instance of the ViewScheduleExportOptions class
Since:
2013

Autodesk.Revit.DB.ViewScheduleExportOptions.#ctor(Autodesk.Revit.DB.ViewScheduleExportOptions)
Constructs a new copy of the input ViewScheduleExportOptions object.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Since:
2013

Autodesk.Revit.DB.ViewScheduleExportOptions
The export options used to export schedule views.
Since:
2013